<!-- dflook/terraform-github-actions {"workspace":"kub1k","backend_type":"local","backend":"35e716e120784a70909e66286e6b091df8652be33143df65e2fa40c5a1db6f91","plan_job_ref":"Job Terraform Plan #95 at https://github.com/ironashram/kub1k/actions/runs/11597651953","plan_out_hash":"5e2549161de10db318ce0d02b4ba655b8f5cd3ec1f1c4635f9f2d5b24d6957fe","plan_hash":"b68083bbcb5210f7cdb8543451d65419133dd286af64cfdb448ae5418d4ca32e","plan_text_format":"diff","version":"1.44.0"} -->
Terraform plan in __terraform__ in the __kub1k__ workspace
<details>
<summary>Plan: 1 to add, 2 to change, 1 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
!~  update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # module.provision_apps[0].helm_release.ingress_nginx will be updated in-place
!~  resource "helm_release" "ingress_nginx" {
        id                         = "ingress-nginx"
        name                       = "ingress-nginx"
!~      version                    = "4.11.3" -> "4.12.0-beta.0"
#        (27 unchanged attributes hidden)
    }

  # module.provision_k3s.data.local_sensitive_file.kubeconfig will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "local_sensitive_file" "kubeconfig" {
+       content              = (sensitive value)
+       content_base64       = (sensitive value)
+       content_base64sha256 = (known after apply)
+       content_base64sha512 = (known after apply)
+       content_md5          = (known after apply)
+       content_sha1         = (known after apply)
+       content_sha256       = (known after apply)
+       content_sha512       = (known after apply)
+       filename             = "/github/home/.kube/config-files/kub1k.yaml"
+       id                   = (known after apply)
    }

  # module.provision_k3s.null_resource.k3s_kubeconfig must be replaced
-/+ resource "null_resource" "k3s_kubeconfig" {
!~      id       = "******************" -> (known after apply)
!~      triggers = { # forces replacement
!~          "timestamp" = "2024-10-25T21:59:21Z" -> (known after apply)
        }
    }

  # module.provision_k3s.vault_kv_secret_v2.k3s will be updated in-place
!~  resource "vault_kv_secret_v2" "k3s" {
!~      data_json           = (sensitive value)
        id                  = "kv/data/kub1k/k3s"
        name                = "kub1k/k3s"
#        (6 unchanged attributes hidden)

#        (1 unchanged block hidden)
    }

Plan: 1 to add, 2 to change, 1 to destroy.
```
</details>

:memo: Plan generated in [Terraform Plan #95](https://github.com/ironashram/kub1k/actions/runs/11597651953)